===
register
===
	inc	rax

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (register))))))

===
constant_numeric
===
	add	7, 6

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (constant
            (constant_numeric)))
        (operand
          (constant
            (constant_numeric)))))))

===
constant_charstr (simple quote)
===
	mov	al, 'yes'

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (register))
        (operand
          (constant
            (constant_charstr)))))))

===
constant_charstr (double quote)
===
	mov	"no", bl

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (constant
            (constant_charstr)))
        (operand
          (register))))))

===
effective_address
===
	mov	[buf], rsi

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (effective_address
            (expression
              (word))))
        (operand
          (register))))))

===
operand_prefix
===
	mov	rax, qword '*'

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (register))
        (operand
          (operand_prefix)
          (constant
            (constant_charstr)))))))

===
operand_prefix strict
===
	mov	rax, strict byte '*'

---
(source_file
  (source_line
    (instruction
      (known_instruction)
      (operands
        (operand
          (register))
        (operand
          (operand_prefix)
          (constant
            (constant_charstr)))))))
