===
register
===
	inc	rax
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (register)))))))
===
constant_numeric
===
	add	7, 6
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (number_literal))
          (operand
            (number_literal)))))))
===
constant_charstr (simple quote)
===
	mov	al, 'yes'
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (register))
          (operand
            (string_literal)))))))
===
constant_charstr (double quote)
===
	mov	"no", bl
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (string_literal))
          (operand
            (register)))))))
===
effective_address
===
	mov	[buf], rsi
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (effective_address
              (word)))
          (operand
            (register)))))))
===
operand_prefix
===
	mov	rax, qword '*'
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (register))
          (operand
            (operand_prefix
              (size_hint))
            (string_literal)))))))
===
operand_prefix strict
===
	mov	rax, strict byte '*'
---
(source_file
  (source_line
    (instruction
      (actual_instruction
        (word)
        (operands
          (operand
            (register))
          (operand
            (operand_prefix
              (size_hint))
            (string_literal)))))))